In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
type(s)

pandas.core.series.Series

In [7]:
s.size

6

In [11]:
dates = pd.date_range('20130101', periods=8)

In [12]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08'],
              dtype='datetime64[ns]', freq='D')

In [13]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [20]:
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=list('ABCD'))

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df

                   A         B         C         D
2013-01-01 -0.294832  2.382020  1.515644 -0.712558
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192
2013-01-03  0.844512 -1.063617  0.776649 -0.325542
2013-01-04 -0.072672 -0.376594  0.452147  0.148403
2013-01-05 -1.399955  0.132858 -0.038926 -1.252879
2013-01-06 -0.724333  2.611496  1.485763 -2.305975
2013-01-07 -0.069862 -0.710175 -0.804640  0.020614
2013-01-08 -0.545861  2.595357  0.180236  1.262242

In [23]:
df2 = pd.DataFrame({'A': 1.,
...: 'B': pd.Timestamp('20130102'),
...: 'C': pd.Series(1, index=list(range(4)), dtype='float32'),
...: 'D': np.array([3] * 4, dtype='int32'),
...: 'E': pd.Categorical(["test", "train", "test", "train"]),
...: 'F': 'foo'})

In [25]:
type(df2)

pandas.core.frame.DataFrame

In [26]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [30]:
df.ndim

2

In [33]:
df.head(3)

                   A         B         C         D
2013-01-01 -0.294832  2.382020  1.515644 -0.712558
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192
2013-01-03  0.844512 -1.063617  0.776649 -0.325542

In [34]:
df.tail(3)

                   A         B         C         D
2013-01-06 -0.724333  2.611496  1.485763 -2.305975
2013-01-07 -0.069862 -0.710175 -0.804640  0.020614
2013-01-08 -0.545861  2.595357  0.180236  1.262242

In [35]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06', '2013-01-07', '2013-01-08'],
              dtype='datetime64[ns]', freq='D')

In [36]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [39]:
df.describe()

              A         B         C         D
count  8.000000  8.000000  8.000000  8.000000
mean  -0.426847  1.017765  0.385930 -0.496486
std    0.703235  1.662487  0.847860  1.055232
min   -1.399955 -1.063617 -0.804640 -2.305975
25%   -0.831193 -0.459989 -0.149054 -0.917864
50%   -0.420347  1.257439  0.316192 -0.519050
75%   -0.071969  2.576920  0.953927  0.052561
max    0.844512  2.611496  1.515644  1.262242

In [96]:
s.value_counts()

8.0    1
6.0    1
5.0    1
3.0    1
1.0    1
dtype: int64

In [41]:
df.T

,2013-01-01 00:00:00,2013-01-02 00:00:00,2013-01-03 00:00:00,2013-01-04 00:00:00,2013-01-05 00:00:00,2013-01-06 00:00:00,2013-01-07 00:00:00,2013-01-08 00:00:00
A,-0.294832,-1.151770,0.844512,-0.072672,-1.399955,-0.724333,-0.069862,-0.545861
B,2.382020,2.570774,-1.063617,-0.376594,0.132858,2.611496,-0.710175,2.595357
C,1.515644,-0.479437,0.776649,0.452147,-0.038926,1.485763,-0.804640,0.180236
D,-0.712558,-0.806192,-0.325542,0.148403,-1.252879,-2.305975,0.020614,1.262242

In [46]:
 df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01 -0.294832  2.382020  1.515644 -0.712558
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192
2013-01-03  0.844512 -1.063617  0.776649 -0.325542
2013-01-04 -0.072672 -0.376594  0.452147  0.148403
2013-01-05 -1.399955  0.132858 -0.038926 -1.252879
2013-01-06 -0.724333  2.611496  1.485763 -2.305975
2013-01-07 -0.069862 -0.710175 -0.804640  0.020614
2013-01-08 -0.545861  2.595357  0.180236  1.262242

In [51]:
df.sort_values(by='D',ascending=False)

                   A         B         C         D
2013-01-08 -0.545861  2.595357  0.180236  1.262242
2013-01-04 -0.072672 -0.376594  0.452147  0.148403
2013-01-07 -0.069862 -0.710175 -0.804640  0.020614
2013-01-03  0.844512 -1.063617  0.776649 -0.325542
2013-01-01 -0.294832  2.382020  1.515644 -0.712558
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192
2013-01-05 -1.399955  0.132858 -0.038926 -1.252879
2013-01-06 -0.724333  2.611496  1.485763 -2.305975

In [53]:
df['B']

2013-01-01    2.382020
2013-01-02    2.570774
2013-01-03   -1.063617
2013-01-04   -0.376594
2013-01-05    0.132858
2013-01-06    2.611496
2013-01-07   -0.710175
2013-01-08    2.595357
Freq: D, Name: B, dtype: float64

In [58]:
df[:3]

                   A         B         C         D
2013-01-01 -0.294832  2.382020  1.515644 -0.712558
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192
2013-01-03  0.844512 -1.063617  0.776649 -0.325542

In [59]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192
2013-01-03  0.844512 -1.063617  0.776649 -0.325542
2013-01-04 -0.072672 -0.376594  0.452147  0.148403

In [61]:
df.loc[dates[1]]

A   -1.151770
B    2.570774
C   -0.479437
D   -0.806192
Name: 2013-01-02 00:00:00, dtype: float64

In [62]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01 -0.294832  2.382020
2013-01-02 -1.151770  2.570774
2013-01-03  0.844512 -1.063617
2013-01-04 -0.072672 -0.376594
2013-01-05 -1.399955  0.132858
2013-01-06 -0.724333  2.611496
2013-01-07 -0.069862 -0.710175
2013-01-08 -0.545861  2.595357

In [63]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02 -1.151770  2.570774
2013-01-03  0.844512 -1.063617
2013-01-04 -0.072672 -0.376594

In [64]:
df.loc['20130102', ['A', 'B']]

A   -1.151770
B    2.570774
Name: 2013-01-02 00:00:00, dtype: float64

In [65]:
df.loc[dates[0], 'A']

-0.29483223221183835

In [66]:
df.at[dates[0], 'A']

-0.29483223221183835

In [68]:
df.iloc[1]

A   -1.151770
B    2.570774
C   -0.479437
D   -0.806192
Name: 2013-01-02 00:00:00, dtype: float64

In [69]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.072672 -0.376594
2013-01-05 -1.399955  0.132858

In [70]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.151770 -0.479437
2013-01-03  0.844512  0.776649
2013-01-05 -1.399955 -0.038926

In [71]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192
2013-01-03  0.844512 -1.063617  0.776649 -0.325542

In [72]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  2.382020  1.515644
2013-01-02  2.570774 -0.479437
2013-01-03 -1.063617  0.776649
2013-01-04 -0.376594  0.452147
2013-01-05  0.132858 -0.038926
2013-01-06  2.611496  1.485763
2013-01-07 -0.710175 -0.804640
2013-01-08  2.595357  0.180236

In [73]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  2.382020  1.515644
2013-01-02  2.570774 -0.479437
2013-01-03 -1.063617  0.776649
2013-01-04 -0.376594  0.452147
2013-01-05  0.132858 -0.038926
2013-01-06  2.611496  1.485763
2013-01-07 -0.710175 -0.804640
2013-01-08  2.595357  0.180236

In [76]:
df[df.B > 0]

                   A         B         C         D
2013-01-01 -0.294832  2.382020  1.515644 -0.712558
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192
2013-01-05 -1.399955  0.132858 -0.038926 -1.252879
2013-01-06 -0.724333  2.611496  1.485763 -2.305975
2013-01-08 -0.545861  2.595357  0.180236  1.262242

In [77]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  2.382020  1.515644       NaN
2013-01-02       NaN  2.570774       NaN       NaN
2013-01-03  0.844512       NaN  0.776649       NaN
2013-01-04       NaN       NaN  0.452147  0.148403
2013-01-05       NaN  0.132858       NaN       NaN
2013-01-06       NaN  2.611496  1.485763       NaN
2013-01-07       NaN       NaN       NaN  0.020614
2013-01-08       NaN  2.595357  0.180236  1.262242

In [79]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.294832  2.382020  1.515644 -0.712558    one
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192    one
2013-01-03  0.844512 -1.063617  0.776649 -0.325542    two
2013-01-04 -0.072672 -0.376594  0.452147  0.148403  three
2013-01-05 -1.399955  0.132858 -0.038926 -1.252879   four
2013-01-06 -0.724333  2.611496  1.485763 -2.305975  three
2013-01-07 -0.069862 -0.710175 -0.804640  0.020614   four
2013-01-08 -0.545861  2.595357  0.180236  1.262242  three

In [80]:
df2[df2['E'].isin(['two', 'three'])]

                   A         B         C         D      E
2013-01-03  0.844512 -1.063617  0.776649 -0.325542    two
2013-01-04 -0.072672 -0.376594  0.452147  0.148403  three
2013-01-06 -0.724333  2.611496  1.485763 -2.305975  three
2013-01-08 -0.545861  2.595357  0.180236  1.262242  three

In [82]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range('20130102',periods=6))

In [83]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [84]:
df['F'] = s1

In [85]:
df

                   A         B         C         D    F
2013-01-01 -0.294832  2.382020  1.515644 -0.712558  NaN
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192  1.0
2013-01-03  0.844512 -1.063617  0.776649 -0.325542  2.0
2013-01-04 -0.072672 -0.376594  0.452147  0.148403  3.0
2013-01-05 -1.399955  0.132858 -0.038926 -1.252879  4.0
2013-01-06 -0.724333  2.611496  1.485763 -2.305975  5.0
2013-01-07 -0.069862 -0.710175 -0.804640  0.020614  6.0
2013-01-08 -0.545861  2.595357  0.180236  1.262242  NaN

In [88]:
df.at[dates[0], 'F'] = 0

In [89]:
df

                   A         B         C         D    F
2013-01-01  0.000000  2.382020  1.515644 -0.712558  0.0
2013-01-02 -1.151770  2.570774 -0.479437 -0.806192  1.0
2013-01-03  0.844512 -1.063617  0.776649 -0.325542  2.0
2013-01-04 -0.072672 -0.376594  0.452147  0.148403  3.0
2013-01-05 -1.399955  0.132858 -0.038926 -1.252879  4.0
2013-01-06 -0.724333  2.611496  1.485763 -2.305975  5.0
2013-01-07 -0.069862 -0.710175 -0.804640  0.020614  6.0
2013-01-08 -0.545861  2.595357  0.180236  1.262242  NaN

In [90]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [91]:
df

                   A         B         C  D    F
2013-01-01  0.000000  2.382020  1.515644  5  0.0
2013-01-02 -1.151770  2.570774 -0.479437  5  1.0
2013-01-03  0.844512 -1.063617  0.776649  5  2.0
2013-01-04 -0.072672 -0.376594  0.452147  5  3.0
2013-01-05 -1.399955  0.132858 -0.038926  5  4.0
2013-01-06 -0.724333  2.611496  1.485763  5  5.0
2013-01-07 -0.069862 -0.710175 -0.804640  5  6.0
2013-01-08 -0.545861  2.595357  0.180236  5  NaN

In [92]:
df2 = df.copy()

In [93]:
df2[df2 > 0] = -df2

In [94]:
df2

                   A         B         C  D    F
2013-01-01  0.000000 -2.382020 -1.515644 -5  0.0
2013-01-02 -1.151770 -2.570774 -0.479437 -5 -1.0
2013-01-03 -0.844512 -1.063617 -0.776649 -5 -2.0
2013-01-04 -0.072672 -0.376594 -0.452147 -5 -3.0
2013-01-05 -1.399955 -0.132858 -0.038926 -5 -4.0
2013-01-06 -0.724333 -2.611496 -1.485763 -5 -5.0
2013-01-07 -0.069862 -0.710175 -0.804640 -5 -6.0
2013-01-08 -0.545861 -2.595357 -0.180236 -5  NaN